### ðŸ”¹ Q3. Create a pivot table to show average salary by Department and Gender.

In [2]:
import pandas as pd
df = pd.DataFrame({
    'Department': ['Tech', 'Tech', 'HR', 'HR', 'Sales', 'Sales'],
    'Gender': ['M', 'F', 'M', 'F', 'M', 'F'],
    'Salary': [85000, 82000, 60000, 63000, 72000, 71000]
})

In [10]:
pivot_table = df.pivot_table(values='Salary', index='Department', columns='Gender', aggfunc='mean')

In [11]:
pivot_table

Gender            F        M
Department
HR          63000.0  60000.0
Sales       71000.0  72000.0
Tech        82000.0  85000.0